def area(a, b):
    '''
    Возвращает площадь прямоугольника.

    Параметры:
        a - длина первой стороны
        b - длина второй стороны

    Возвращаемое значение:
        Площадь прямоугольника, вычисленная по формуле a * b
    '''
    return a * b

    
def perimeter(a, b):
    ''' 
    Возвращает периметр прямоугольника.

    Параметры:
        a - длина первой стороны
        b - длина второй стороны

    Возвращаемое значение:
        Периметр прямоугольника, вычисленный по формуле (a + b) * 2
    '''
    return (a + b) * 2