def area(a, h):
    ''' 
    Возвращает площадь треугольника.

    Параметры:
        a - длина основания
        h - длина высоты

    Возвращаемое значение:
        Площадь треугольника, вычисленная по формуле a * h / 2
    '''
    return a * h / 2
    
def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

    Параметры:
        a - длина первой стороны
        b - длина второй стороны
        c - длина третьей стороны

    Возвращаемое значение:
        Периметр треугольника, вычисленный по формуле a + b + c
    '''
    return a + b + c