def area(a, h):
    ''' 
    Возвращает площадь треугольника.

    Параметры:
        a (int): длина основания
        h (int): длина высоты

    Возвращаемое значение:
        area (float): площадь треугольника
    '''
    return a * h / 2
    
def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

    Параметры:
        a (int): длина первой стороны
        b (int): длина второй стороны
        c (int): длина третьей стороны

    Возвращаемое значение:
        perimeter (int): периметр треугольника
    '''
    return a + b + c